content/posts-org/leetcode-tips.org
#+hugo_base_dir: ../../
# -*- mode: org; coding: utf-8; -*-
* Header Information                                               :noexport:
#+LaTeX_CLASS_OPTIONS: [11pt]
#+LATEX_HEADER: \usepackage{helvetica}
#+LATEX_HEADER: \setlength{\textwidth}{5.1in} % set width of text portion
#+LATEX_HEADER: \usepackage{geometry}
#+TITLE:     LeetCode tips
#+AUTHOR:    Fei Ni
#+EMAIL:     fei.ni@helix.com
#+DATE:      2022-04-25
#+HUGO_CATEGORIES: helix
#+HUGO_tags: helix
#+hugo_auto_set_lastmod: t
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+OPTIONS:   ^:{}
#+INFOJS_OPT: view:nil toc:nil ltoc:nil mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+HTML_HEAD: <link rel="stylesheet" href="org.css" type="text/css"/>
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:
#+LINK_HOME:
#+XSLT:

#+STARTUP: hidestars

#+STARTUP: overview   (or: showall, content, showeverything)
http://orgmode.org/org.html#Visibility-cycling  info:org#Visibility cycling

#+TODO: TODO(t) NEXT(n) STARTED(s) WAITING(w@/!) SOMEDAY(S!) | DONE(d!/!) CANCELLED(c@/!)
http://orgmode.org/org.html#Per_002dfile-keywords  info:org#Per-file keywords

#+TAGS: important(i) private(p)
#+TAGS: @HOME(h) @OFFICE(o)
http://orgmode.org/org.html#Setting-tags  info:org#Setting tags

#+NOstartup: beamer
#+NOLaTeX_CLASS: beamer
#+NOLaTeX_CLASS_OPTIONS: [bigger]
#+NOBEAMER_FRAME_LEVEL: 2


# Start from here


* Bit o/p
** set a bit in pos for number
   #+begin_src c++
num |= (1 << pos);
   #+end_src
** unset/clear a bit in pos for number
   #+begin_src c++
num &= (~(1 << pos));
   #+end_src

** Toggling a bit at nth position
   #+begin_src c++
num ^= (1 << pos);
   #+end_src

** Checking if bit at nth position is set or unset:
   #+begin_src c++
bool bit = num & (1<<pos);
   #+end_src

** Stripping off the lowest set bit :
   #+begin_src c++
num = num & (num-1);
   #+end_src
** Getting lowest set bit of a number

   #+begin_src c++
int ret = num & (-num);
   #+end_src
** XOR
   #+begin_src c++
     0^N == N
     N^N == 0
     M^N == N^M
     a^b^a = b
   #+end_src

   #+begin_src python
     '''
     Given an integer array nums, in which exactly two elements appear only once and all the other elements appear exactly twice. Find the two elements that appear only once. You can return the answer in any order.

     You must write an algorithm that runs in linear runtime complexity and uses only constant extra space.



     Example 1:

     Input: nums = [1,2,1,3,2,5]
     Output: [3,5]
     Explanation:  [5, 3] is also a valid answer.
     '''
    from functools import reduce
    class Solution(object):
        def singleNumber(self, nums):
  	  a_xor_b = reduce(lambda x, y: x ^ y, nums)
  	  xor_sum = dict()
  	  for a in nums:
  	      b = a_xor_b ^ a
  	      if b in xor_sum and xor_sum[b] == a:
  		  return [b,a]
  	      xor_sum[a] = b
   #+end_src
   - https://leetcode.com/problems/binary-gap/
   - https://leetcode.com/problems/single-number-iii/
   - https://leetcode.com/problems/decode-xored-permutation/
   - https://emre.me/computer-science/bit-manipulation-tricks/
* String tips
  #+begin_src python
    # check if a string is something like "abcabcabc"
    def repeatedSubstringPattern(self, str):
	return str in (2 * str)[1:-1]
  #+end_src
  #+begin_src python
    def isRotatedFrom(self, s1, s2):
        return s1 in (s2 + s2)
  #+end_src
* Linked List
  #+begin_src python
 class ListNode(object):
     def __init__(self, x):
         self.val = x
         self.next = None
  #+end_src
  #+begin_src c++
 struct ListNode {
     int val;
     ListNode *next;
     ListNode() : val(0), next(nullptr) {}
     ListNode(int x) : val(x), next(nullptr) {}
     ListNode(int x, ListNode *next) : val(x), next(next) {}
 };
  #+end_src
  - Dummy node
  - three points (pre, curr, next)
  - https://leetcode.com/problems/remove-duplicates-from-sorted-list-ii/
  - https://leetcode.com/problems/reverse-linked-list/
  - https://leetcode.com/problems/lru-cache/ (hash + linkedList)
  - https://leetcode.com/problems/lfu-cache/
    #+begin_src c++
      list<int> usage;
      //  insert key into the begin of list
      usage.insert(usage.begin(), key);
      // move the node of it to the begin of list
      usage.splice(usage.begin(), usage, it);
   #+end_src
* GCD and LCM
  #+begin_src python
def gcd(x, y):
    while y > 0:
        x, y = y, x % y
    return x

def lcm(x, y):
    return x*y // gcd(x,y)

x = 10
y = 15

gcdRet = gcd(x,y)
print(f"gcd({x},{y}) = {gcdRet}") # gcd(10,15) = 5
lcmRet = lcm(x,y)
print(f"lcm({x},{y}) = {lcmRet}") # lcm(10,15) = 30
  #+end_src
* tortoise & hare
  #+begin_src python
class Solution:
    def findDuplicate(self, nums):
        # Find the intersection point of the two runners.
        tortoise = nums[0]
        hare = nums[0]
        while True:
            # print "tortoise: %d, hare: %d" % (tortoise, hare)
            tortoise = nums[tortoise]
            hare = nums[nums[hare]]
            # print "tortoise: %d, hare: %d" % (tortoise, hare)
            if tortoise == hare:
                break
        # Find the "entrance" to the cycle.
        ptr1 = nums[0]
        ptr2 = tortoise
        while ptr1 != ptr2:
            ptr1 = nums[ptr1]
            ptr2 = nums[ptr2]
        return ptr1
  #+end_src
