content/posts/leetcode-tips.md


## <span class="section-num">5</span> Sliding window {#sliding-window}

Sliding Window Technique is a method for finding subarrays in an array that satisfy given conditions.
We do this via maintaining a subset of items as our window, and resize and move that window within the larger list until we find a solution.
Sliding Window Technique is a subset of Dynamic Programming, and it frequently appears in algorithm interviews.

Examples:

-   Easy: Statically Sized Sliding Window: Given an array of integers, find maximum/minimum sum subarray of the required size.
-   Medium: Dynamically Sized Sliding Window: Given an array of positive integers, find the subarrays that add up to a given number.
-   Variation (Medium): Same question but for an array with all integers (positive, 0, negative). The optimal solution is Kadane’s Algorithm, but Sliding Window can still be applied with modifications (not recommended though).
-   Medium: Flipping/Swapping: Given an array of 0’s and 1’s, find the maximum sequence of continuous 1’s that can be formed by flipping at-most k 0’s to 1’s.
-   Hard: Strings: Given a string and n characters, find the shortest substring that contains all the desired characters.

    ```python
    # Given a binary array nums and an integer k, return the maximum number of consecutive 1's in the array if you can flip at most k 0's.
    # Input: nums = [1,1,1,0,0,0,1,1,1,1,0], k = 2
    # Output: 6
    # Explanation: [1,1,1,0,0,1,1,1,1,1,1]
    # Bolded numbers were flipped from 0 to 1. The longest subarray is underlined.
    class Solution:
        def longestOnes(self, nums: List[int], k: int) -> int:
    	left = 0
    	for right in range(len(nums)):
    	    # If we included a zero in the window we reduce the value of k.
    	    # Since k is the maximum zeros allowed in a window.
    	    k -= 1 - nums[right]
    	    # A negative k denotes we have consumed all allowed flips and window has
    	    # more than allowed zeros, thus increment left pointer by 1 to keep the window size same.
    	    if k < 0:
    		# If the left element to be thrown out is zero we increase k.
    		k += 1 - nums[left]
    		left += 1
    	return right - left + 1

    ```

Links:

-   <https://quanticdev.com/algorithms/dynamic-programming/sliding-window/>
-   <https://leetcode.com/problems/max-consecutive-ones-iii>


## <span class="section-num">6</span> Heap {#heap}

scenarios:

-   top K ordered items
-   two-heaps pattern,  where we are given a set of elements such that we can divide them into two parts, To be able to solve these kinds of problems, we want to know the smallest element in one part and the biggest element in the other part.
    -   <https://emre.me/coding-patterns/two-heaps/>

Notes:

-   python default heap is minHeap
-   C++ default heap is maxHeap

<!--listend-->

```cpp
class Solution {
public:
    int findKthLargest(vector<int>& nums, int k) {
	// using minHeap here
	priority_queue<int, vector<int>, greater<int>> pq;
	for (int num : nums) {
	    pq.push(num);
	    if (pq.size() > k) {
		pq.pop();
	    }
	}
	return pq.top();
    }
};
```

```python
def findKthLargest(self, nums, k):
    heap = nums[:k]
    heapify(heap)
    for n in nums[k:]:  heappushpop(heap, n)
    return heap[0]
```

```python
from heapq import *

class MedianFinder:
    def __init__(self):
	"""
	initialize your data structure here.
	"""
	self.small = []
	self.large = []
	# heapq.heapify(self.small)
	# heapq.heapify(self.large)


    def addNum(self, num: int) -> None:
	heapq.heappush(self.small,num)
	tmp = heapq.heappop(self.small)
	heapq.heappush(self.large, -1 * tmp)
	if len(self.large) > len(self.small):
	    tmp = heapq.heappop(self.large)
	    heapq.heappush(self.small, -1 * tmp)


    def findMedian(self) -> float:
	if len(self.large) == len(self.small):
	    return (-1 * self.large[0] + self.small[0]) / 2
	else:
	    return self.small[0]
```

-   <https://leetcode.com/problems/find-median-from-data-stream/>


## <span class="section-num">7</span> Binary Search {#binary-search}

```c++
vector<int> searchRange(vector<int>& nums, int target) {
     return {findBound(nums, target, true), findBound(nums, target, false)};
}

 int findBound(vector<int>& nums, int target, bool lower) {
     int l = 0, r = nums.size() - 1, answer = -1;

     while(l <= r) {
	 int mid = (l+r)/2;
	 if (nums[mid] == target) {
	     answer = mid; // keep the current answer as you mignt not be able to comback if this was the answer.
	     if (lower) {
		 r = mid - 1;
	     } else {
		 l = mid + 1;
	     }
	 } else if (nums[mid] > target) {
	     r = mid - 1;
	 } else {
	     l = mid + 1;
	 }
     }

     return answer;
 }
```

```python
import bisect

# bisect_left(a, x, lo=0, hi=None)
# This method returns the index i where must be inserted the value x such that list a is kept ordered
a = [1, 3, 5, 6, 7, 9, 10, 12, 14]
x = 8
# i = bisect.bisect_left(a, x, lo=2, hi=7) # [5, 6, 7, 9, 10]
i = bisect.bisect_left(a, x)
print(i) # 5
a.insert(i, x)
print(a) # [1, 3, 5, 6, 7, 8, 9, 10, 12, 14]

# bisect_right(a, x, lo=0, hi=None)
# This function works the same as bisect_left but in the event that x value already appears in the a list , the index i would be just after the rightmost x value already there.
a = [1, 2, 3, 4, 4, 7]
x = 4
i = bisect.bisect_right(a, x)
print(i) # 5

a.insert(i, x)
print(a) # [1, 2, 3, 4, 4, 4, 7]
```

-   <https://leetcode.com/problems/capacity-to-ship-packages-within-d-days/>


## <span class="section-num">8</span> Rolling Hash {#rolling-hash}

```c++
class Solution {
public:
    string longestPrefix(string &s) {
	long h1 = 0, h2 = 0, mul = 1, len = 0, mod = 1000000007;
	for (int i = 0, j = s.length() - 1; j > 0; ++i, --j) {
	    int first = s[i] - 'a', last = s[j] - 'a';
	    h1 = (h1 * 26 + first) % mod;
	    h2 = (h2 + mul * last) % mod;
	    mul = mul * 26 % mod;
	    if (h1 == h2)
		len = i + 1;
	}
	return s.substr(0, len);
    }
};

```

```python
class Solution(object):
    def longestPrefix(self, s):
	hashF = hashB = 0
	code = 32
	mod = int(1e9 + 7)

	l = 0
	mul = 1
	for i in range(len(s) - 1):
	    hashF = (hashF * code + ord(s[i])) % mod
	    hashB = (hashB + ord(s[~i]) * mul) % mod
	    mul = (mul * code) % mod
	    if hashF == hashB:
		l = i + 1
	return s[:l]

```

-   <https://leetcode.com/problems/longest-happy-prefix/>


## <span class="section-num">9</span> Stack {#stack}

-   <https://leetcode.com/problems/valid-parentheses/>


## <span class="section-num">10</span> Monotonic stack {#monotonic-stack}

```python
# trapping-rain-water
class Solution:
    def trap(self, height: List[int]) -> int:
	res, stk = 0, []
	for i in range(len(height)):
	    while stk and height[i] > height[stk[-1]]:
		h = height[stk.pop()]
		if stk:
		    minH = min(height[stk[-1]], height[i])
		    res += (minH - h) * (i - stk[-1] - 1)
	    stk.append(i)
	returnb2 res
```

-   <https://leetcode.com/problems/largest-rectangle-in-histogram/>
-   <https://leetcode.com/problems/trapping-rain-water/>
