content/posts/leetcode-tips.md


## <span class="section-num">11</span> Queue {#queue}


## <span class="section-num">12</span> Robot Bounded In Circle {#robot-bounded-in-circle}

It's said to be used by Amazon very often

```python
class Solution(object):
    def isRobotBounded(self, instructions):
	"""
	:type instructions: str
	:rtype: bool
	"""

	di = (0,1)
	# G -> (0,1), L -> (-1,0), R -> (1,0)
	x,y = 0,0
	for instruction in instructions:
	    if instruction == 'G':
		x,y = x+di[0],y+di[1]
	    elif instruction == 'L':
		di = (-di[1],di[0]) # very smart way to change direction
	    else:
		di = (di[1],-di[0])
	return (x==0 and y==0) or di!=(0,1)
```

-   <https://leetcode.com/problems/robot-bounded-in-circle/>


## <span class="section-num">13</span> Monotonic queue {#monotonic-queue}


## <span class="section-num">14</span> Tree traverse {#tree-traverse}

-   <https://www.geeksforgeeks.org/construct-tree-from-given-inorder-and-preorder-traversal/?ref=lbp>
-


## <span class="section-num">15</span> Trie Tree {#trie-tree}

```bash
A trie (pronounced as "try") or prefix tree is a tree data structure used to efficiently store and retrieve keys in a dataset of strings.
There are various applications of this data structure, such as autocomplete and spellchecker.

Implement the Trie class:

Trie() Initializes the trie object.
void insert(String word) Inserts the string word into the trie.
boolean search(String word) Returns true if the string word is in the trie (i.e., was inserted before), and false otherwise.
boolean startsWith(String prefix) Returns true if there is a previously inserted string word that has the prefix prefix, and false otherwise.
```

```python
class TrieNode:
    # Initialize your data structure here.
    def __init__(self):
	self.children = collections.defaultdict(TrieNode)
	self.is_word = False

class Trie:
    def __init__(self):
	self.root = TrieNode()
    def insert(self, s):
	curr = self.root
	for i in s:
	    curr = curr.children[i]
	curr.is_word = True
    def search(self, s):
	curr = self.root
	for i in s:
	    if i in curr.children:
		curr = curr.children[i]
	    else:
		return False
	return curr.is_word

    def startsWith(self,s):
	curr = self.root
	for i in s:
	    if i in curr.children:
		curr = curr.children[i]
	    else:
		return False
	return True
```

```c++
class Trie {
public:
    Trie() {}

    void insert(string word) {
	Trie* node = this;
	for (char ch : word) {
	    if (!node->next.count(ch)) { node->next[ch] = new Trie(); }
	    node = node->next[ch];
	}
	node->isword = true;
    }

    bool search(string word) {
	Trie* node = this;
	for (char ch : word) {
	    if (!node->next.count(ch)) { return false; }
	    node = node->next[ch];
	}
	return node->isword;
    }

    bool startsWith(string prefix) {
	Trie* node = this;
	for (char ch : prefix) {
	    if (!node->next.count(ch)) { return false; }
	    node = node->next[ch];
	}
	return true;
    }

private:
    map<char, Trie*> next = {};
    bool isword = false;
};
```

-   <https://leetcode.com/problems/implement-trie-prefix-tree/submissions/>


## <span class="section-num">16</span> Segment Tree {#segment-tree}

```python
#Segment tree node
class Node(object):
    def __init__(self, start, end):
	self.start = start
	self.end = end
	self.total = 0
	self.left = None
	self.right = None

class NumArray(object):
    def __init__(self, nums):
	"""
	initialize your data structure here.
	:type nums: List[int]
	"""
	#helper function to create the tree from input array
	def createTree(nums, l, r):
	    #base case
	    if l > r:
		return None
	    #leaf node
	    if l == r:
		n = Node(l, r)
		n.total = nums[l]
		return n
	    mid = (l + r) // 2
	    root = Node(l, r)
	    #recursively build the Segment tree
	    root.left = createTree(nums, l, mid)
	    root.right = createTree(nums, mid+1, r)

	    #Total stores the sum of all leaves under root
	    #i.e. those elements lying between (start, end)
	    root.total = root.left.total + root.right.total
	    return root
	self.root = createTree(nums, 0, len(nums)-1)

    def update(self, i, val):
	"""
	:type i: int
	:type val: int
	:rtype: int
	"""
	#Helper function to update a value
	def updateVal(root, i, val):
	    #Base case. The actual value will be updated in a leaf.
	    #The total is then propogated upwards
	    if root.start == root.end:
		root.total = val
		return val
	    mid = (root.start + root.end) // 2
	    #If the index is less than the mid, that leaf must be in the left subtree
	    if i <= mid:
		updateVal(root.left, i, val)
	    #Otherwise, the right subtree
	    else:
		updateVal(root.right, i, val)
	    #Propogate the changes after recursive call returns
	    root.total = root.left.total + root.right.total

	    return root.total

	return updateVal(self.root, i, val)

    def sumRange(self, i, j):
	"""
	sum of elements nums[i..j], inclusive.
	:type i: int
	:type j: int
	:rtype: int
	"""
	#Helper function to calculate range sum
	def rangeSum(root, i, j):
	    #If the range exactly matches the root, we already have the sum
	    if root.start == i and root.end == j:
		return root.total
	    mid = (root.start + root.end) // 2
	    #If end of the range is less than the mid, the entire interval lies
	    #in the left subtree
	    if j <= mid:
		return rangeSum(root.left, i, j)
	    #If start of the interval is greater than mid, the entire inteval lies
	    #in the right subtree
	    elif i >= mid + 1:
		return rangeSum(root.right, i, j)
	    #Otherwise, the interval is split. So we calculate the sum recursively,
	    #by splitting the interval
	    else:
		return rangeSum(root.left, i, mid) + rangeSum(root.right, mid+1, j)
	return rangeSum(self.root, i, j)

# Your NumArray object will be instantiated and called as such:
# numArray = NumArray(nums)
# numArray.sumRange(0, 1)
# numArray.update(1, 10)
# numArray.sumRange(1, 2)
```

-   <https://leetcode.com/problems/range-sum-query-mutable/>
