content/posts/leetcode-tips.md


## <span class="section-num">17</span> Binary index tree （树状数组) {#binary-index-tree-树状数组}

It's also named as Fenwick tree
Doing similar work as segment tree, less code, both are good at rangeSum and rangeQuery
The idea to create a array bit, bit[x] store the sum of bit[x-lowBit(x)+1,x] inclusive.
please notice, bit is using 1-based indexing

-   [About binary index tree](https://blog.csdn.net/bestsort/article/details/80796531?spm=1001.2101.3001.6650.3&utm%5Fmedium=distribute.pc%5Frelevant.none-task-blog-2%7Edefault%7EBlogCommendFromBaidu%7EHighlightScore-3.queryctrv2&depth%5F1-utm%5Fsource=distribute.pc%5Frelevant.none-task-blog-2%7Edefault%7EBlogCommendFromBaidu%7EHighlightScore-3.queryctrv2&utm%5Frelevant%5Findex=6)
-   <https://www.youtube.com/watch?v=RgITNht%5Ff4Q>

<!--listend-->

```python
def lowBit(n):
    return n & (-n)
class BIT:
    def __init__(self, size):
	self.bit = [0] * (size + 1)

    def getSum(self, idx):  # Get sum in range [1..idx], 1-based indexing
	s = 0
	while idx > 0:
	    s += self.bit[idx]
	    idx -= lowBit(idx)
	return s

    def getSumRange(self, left, right):  # left, right inclusive, 1-based indexing
	return self.getSum(right) - self.getSum(left - 1)

    def addValue(self, idx, val):  # 1-based indexing
	while idx < len(self.bit):
	    self.bit[idx] += val
	    idx += lowBit(idx)

class NumArray:

    def __init__(self, nums: List[int]):
	self.nums = nums
	self.bit = BIT(len(nums))
	for i, v in enumerate(nums):
	    self.bit.addValue(i+1, v)

    def update(self, index: int, val: int) -> None:
	diff = val - self.nums[index]  # get diff amount of `val` compared to current value
	self.bit.addValue(index+1, diff)  # add this `diff` amount at index `index+1` of BIT, plus 1 because in BIT it's 1-based indexing
	self.nums[index] = val # update latest value of `nums[index]`

    def sumRange(self, left: int, right: int) -> int:
	return self.bit.getSumRange(left+1, right+1)
```

-   <https://leetcode.com/problems/range-sum-query-mutable/discuss/1406686/C%2B%2BJavaPython-Binary-Indexed-Tree>
-   <https://zhuanlan.zhihu.com/p/92920381>


## <span class="section-num">18</span> Union Find {#union-find}

```python
# Idea: find minimal edges to make graph fully traversable
# - we can use union-find here, we will have 2 union here, one for Alice, one for Bob
# - because type 3 may add travese for both Alice and Boby, so we will pick such edges firstly
# - every time while we pick one edge, we update the union, also update the requiredEdgeNum, if both node of this edge alread in union, we don't need add this edge
# - At the end we check if both union are fully connected, if yes, the answer is len(edges) - requiredEdgeNum
class UnionFind:
    def __init__(self,n):
	self.distinct_component_num = n
	self.components = list(range(n+1))
    def union(self,i,j):
	if self.find(i) == self.find(j):
	    return False
	else:
	    self.components[self.find(i)] = j
	    self.distinct_component_num -= 1
	    return True

    def find(self,i):
	if i == self.components[i]:
	    return i
	else:
	    self.components[i] = self.find(self.components[i])
	    return self.components[i]

    def connected(self):
	return self.distinct_component_num == 1

class Solution:
    def maxNumEdgesToRemove(self, n: int, edges: List[List[int]]) -> int:
	required_edge_num = 0
	edges.sort(key=lambda x:x[0], reverse = True)
	alice = UnionFind(n)
	bob = UnionFind(n)
	for e in edges:
	    if e[0] == 3:
		tmp1 = alice.union(e[1],e[2])
		tmp2 = bob.union(e[1],e[2])
		if tmp1 or tmp2:
		    required_edge_num += 1
	    elif e[0] == 2:
		if bob.union(e[1],e[2]):
		    required_edge_num += 1
	    elif e[0] == 1:
		if alice.union(e[1],e[2]):
		    required_edge_num += 1
	if alice.connected() and bob.connected():
	    return len(edges) - required_edge_num
	else:
	    return -1
```

```python
# a graph is a valid tree only if len(edges) == n-1 and no cycle
def validTree(self, n, edges):
    parent = list(range(n))
    def find(x):
	return x if parent[x] == x else find(parent[x])
    def union(xy): # xy is a list of x and y
	x, y = map(find, xy)
	parent[x] = y
	return x != y
    return len(edges) == n-1 and all(map(union, edges))
```

-   <https://leetcode.com/problems/remove-max-number-of-edges-to-keep-graph-fully-traversable/>
-   <https://leetcode.com/problems/checking-existence-of-edge-length-limited-paths/>
-   <https://leetcode.com/problems/checking-existence-of-edge-length-limited-paths-ii/>


## <span class="section-num">19</span> DFS {#dfs}

```python
class Solution:
    def numIslands(self, grid):
	if not grid:
	    return 0

	count = 0
	for i in range(len(grid)):
	    for j in range(len(grid[0])):
		if grid[i][j] == '1':
		    self.dfs(grid, i, j)
		    count += 1
	return count

    def dfs(self, grid, i, j):
	if i<0 or j<0 or i>=len(grid) or j>=len(grid[0]) or grid[i][j] != '1':
	    return
	grid[i][j] = '#'
	self.dfs(grid, i+1, j)
	self.dfs(grid, i-1, j)
	self.dfs(grid, i, j+1)
	self.dfs(grid, i, j-1)
```

-   <https://leetcode.com/problems/number-of-islands/>


## <span class="section-num">20</span> BFS {#bfs}

```python
# Definition for a binary tree node.
# class TreeNode:
#     def __init__(self, val=0, left=None, right=None):
#         self.val = val
#         self.left = left
#         self.right = right
class Solution:
    def zigzagLevelOrder(self, root: Optional[TreeNode]) -> List[List[int]]:
	if not root:
	    return []
	q = deque([root])
	ret = []
	level = 0
	while len(q) > 0:
	    sz = len(q)
	    current = [-1] * sz
	    for i in range(0,sz):
		node = q.popleft()
		if level % 2 == 0:
		    current[i] = node.val
		else:
		    current[sz-i-1] = node.val
		if node.left: q.append(node.left)
		if node.right: q.append(node.right)
	    level += 1
	    ret.append(current)
	return ret
```

-   <https://leetcode.com/problems/binary-tree-zigzag-level-order-traversal/>


## <span class="section-num">21</span> Sort {#sort}

Sort 2D array

```cpp
vector<vector<int>>& edges;
sort(begin(edges), end(edges),
     [](vector<int>& a, vector<int>& b) { return a[0] > b[0]; });
```

```python
edges: List[List[int]]
edges.sort(key:lambda x: x[0], reverse=False)
```

More python example:

```python
  l = [[1,2,3],[3,4,6,],[2,4,5],[2,101,5],[2,34,1]]
  l.sort(key=lambda x: (x[0],x[1]), reverse=True)
  print(l)


  students= [['Harry', 37.21], ['Berry', 37.21], ['Tina', 37.2], ['Akriti', 41.0], ['Harsh', 39.0]]

  def compare(e):
    return (e[1],e[0])

  students = sorted(students,key=compare)
  print(students)


  # task: sort the list of strings, such that items listed as '_fw' come before '_bw'
  foolist = ['Goo_fw', 'Goo_bw', 'Foo_fw', 'Foo_bw', 'Boo_fw', 'Boo_bw']

  def sortfoo(s):
      s1, s2 = s.split('_')
      r = 1 if s2 == 'fw' else 2     # forces 'fw' to come before 'bw'
      return (r, s1)                 # order first by 'fw'/'bw', then by name

  foolist.sort(key=sortfoo)          # sorts foolist inplace

  print(foolist)
  # prints:
  # ['Boo_fw', 'Foo_fw', 'Goo_fw', 'Boo_bw', 'Foo_bw', 'Goo_bw']

class Solution:
    def frequencySort(self, nums: List[int]) -> List[int]:
	r = Counter(nums)
	return sorted(nums, key=lambda x: (r[x], -x))
```
