content/posts-org/leetcode-tips.org
* Topology sort
  #+begin_src python
class Solution:    
    def findOrder(self, N,P):
        graph = defaultdict(list)
        indegree = [0] * N
        q = deque()
        ans = []
        for nxt, pre in P:
            graph[pre].append(nxt)
            indegree[nxt] += 1
        for i in range(N):
            if indegree[i] == 0:
                q.append(i)
        while q:
            cur = q.popleft()
            ans.append(cur)
            for nxt in graph[cur]:
                indegree[nxt] -= 1
                if indegree[nxt] == 0:
                    q.append(nxt)
        return ans if len(ans) == N else []
  #+end_src
  - https://leetcode.com/problems/course-schedule/
  - https://leetcode.com/problems/course-schedule-ii/
  
* DP
  #+begin_src python
class Solution:
    def maxValue(self, events: List[List[int]], k: int) -> int:        
        events.sort()
        starts = [x for x,y,z in events]
        
        @lru_cache(None)
        def dp(idx, k):
            if k == 0 or idx >= len(events):
                return 0
            next_event = bisect_right(starts, events[idx][1])
            return max(dp(idx+1, k), events[idx][2] + dp(next_event, k-1))
    
        return dp(0,k)
  #+end_src

  #+begin_src python
class Solution(object):
    def wordBreak(self, s, words):
        dp = [True] + [False] * len(s)
        for i in range(1, len(s)+1):
            for j in range(i):
                if dp[j] and s[j:i] in words:
                    dp[i] = True
        return dp[-1]

  #+end_src
  - https://leetcode.com/problems/word-break/
  - https://leetcode.com/problems/maximum-number-of-events-that-can-be-attended-ii/
  - https://leetcode.com/problems/number-of-ways-to-stay-in-the-same-place-after-some-steps/
* Backtracking
  #+begin_src python
#Given an array nums of distinct integers, return all the possible permutations. You can return the answer in any order.
class Solution(object):
    def permute(self, l):
        if len(l) == 0:
            return [[]]
        permuations = []
        curr = []
        isVisited = [False] * len(l)
        self.backTracking(permuations, curr, isVisited, l)
        return permuations

    def backTracking(self, permuations,  curr, isVisited, l):
        if len(curr) == len(l):
            permuations.append(curr[:])
            return

        for i in range(len(l)):
            if not isVisited[i]:
                isVisited[i] = True
                curr.append(l[i])
                self.backTracking(permuations, curr, isVisited, l)
                isVisited[i] = False
                curr.pop()
  #+end_src
  #+begin_src python
class Solution:
    def subsets(self, nums: List[int]) -> List[List[int]]:
        result=[]
        def backtrack(nums, start, path):
            result.append(path[:])
            for i in range(start, len(nums)):
                path.append(nums[i])
                backtrack(nums,i+1,path)
                path.pop()
        backtrack(nums, 0, [])
        return result
  #+end_src
   - https://leetcode.com/problems/permutations/submissions/
   - https://leetcode.com/problems/word-search-ii/
   - https://leetcode.com/problems/subsets/
* Standard parser implementation
  #+begin_src python
class Solution:
    # Standard parser implementation based on this BNF
    #   s := expression
    #   expression := term | term { [+,-] term] }
    #   term := factor | factor { [*,/] factor] }
    #   factor :== digit | '(' expression ')'
    #   digit := [0..9]
    
    def expTree(self, s: str) -> 'Node':
        tokens = collections.deque(list(s))
        return self.parse_expression(tokens)

    def parse_expression(self, tokens):
        lhs = self.parse_term(tokens)
        while len(tokens) > 0 and tokens[0] in ['+', '-']:
            op = tokens.popleft()
            rhs = self.parse_term(tokens)
            lhs = Node(val=op, left=lhs, right=rhs)
        return lhs
    
    def parse_term(self, tokens):
        lhs = self.parse_factor(tokens)
        while len(tokens) > 0 and tokens[0] in ['*', '/']:
            op = tokens.popleft()
            rhs = self.parse_factor(tokens)
            lhs = Node(val=op, left=lhs, right=rhs)
        return lhs

    def parse_factor(self, tokens):
        if tokens[0] == '(':
            tokens.popleft() # consume '('
            node = self.parse_expression(tokens)
            tokens.popleft() # consume ')'
            return node
        else:
            # Single operand
            token = tokens.popleft()
            return Node(val=token)
  #+end_src
  - https://leetcode.com/problems/build-binary-expression-tree-from-infix-expression/
* Prim algorithm (To find minimum spanning tree)
  #+begin_src python
class Solution:
    def minCostConnectPoints(self, points: List[List[int]]) -> int:
        manhattan = lambda p1, p2: abs(p1[0]-p2[0]) + abs(p1[1]-p2[1])
        n, c = len(points), collections.defaultdict(list)
        # create the graph with cost in each edges
        for i in range(n):
            for j in range(i+1, n):
                d = manhattan(points[i], points[j])
                c[i].append((d, j))
                c[j].append((d, i))
        # start from point 0
        cnt, ans, visited, heap = 1, 0, [0] * n, c[0]
        visited[0] = 1
        # the reason to use heap is to get the smaller cost another node
        heapq.heapify(heap)
        while heap:
            d, j = heapq.heappop(heap)
            if not visited[j]:
                visited[j], cnt, ans = 1, cnt+1, ans+d
                for record in c[j]: heapq.heappush(heap, record)
            if cnt >= n: break
        return ans
  #+end_src
  - https://leetcode.com/problems/min-cost-to-connect-all-points/
* Kluskal algorithm (To find minimun spanning tree)
  #+begin_src python
class UnionFind:
    def __init__(self, n):
        self.parent = [i for i in range(n)]

    def find(self, u):
        if u != self.parent[u]:
            self.parent[u] = self.find(self.parent[u])
        return self.parent[u]

    def union(self, u, v):
        pu, pv = self.find(u), self.find(v)
        if pu == pv: return False
        self.parent[pu] = pv
        return True


class Solution:
    def minCostConnectPoints(self, points: List[List[int]]) -> int:
        def manhattanDist(p1, p2):
            return abs(p1[0] - p2[0]) + abs(p1[1] - p2[1])

        edges = []
        n = len(points)
        for i in range(n):
            for j in range(i + 1, n):
                edges.append([manhattanDist(points[i], points[j]), i, j])

        edges.sort()  # Sort increasing order by dist
        uf = UnionFind(n)
        ans = 0
        for d, u, v in edges:
            if uf.union(u, v):
                ans += d
                n -= 1
            if n == 1: break  # a bit optimize when we found enough n-1 edges!
        return ans
  #+end_src
    - https://leetcode.com/problems/min-cost-to-connect-all-points/
* multiple threading
  #+begin_src python
from threading import Lock

class Foo:
    def __init__(self):
        self.locks = (Lock(),Lock())
        self.locks[0].acquire()
        self.locks[1].acquire()
        
    def first(self, printFirst):
        printFirst()
        self.locks[0].release()
        
    def second(self, printSecond):
        with self.locks[0]:
            printSecond()
            self.locks[1].release()
            
            
    def third(self, printThird):
        with self.locks[1]:
            printThird()
  #+end_src

  #+begin_src python
'''
There are two kinds of threads: oxygen and hydrogen. Your goal is to group these threads to form water molecules.

This solution uses Semaphore and Barrier. It is simple to understand, and performs well.

Semantics
a Semaphore -- trying to acquire it, is possible if there are tokens left. Otherwise the thread that tried is asked to wait until a different thread returns the tokens it was using.
a Barrier -- if a thread reaches it, it can cross it, only if a predefined number of other threads have also arrived.
Logic
The solution creates 1 Semaphore for Hydrogen, and allows 2 threads to aquire it concurrently. Likewise, we create one for Oxygen, but this one only allows 1 thread.

To ensure the molecule is generated at once, we use a barrier, which can only be crossed when 3 atoms have gathered.

After each function completes, we release the token on the Semaphore.
'''

from threading import Semaphore
from threading import Barrier

class H2O:
    def __init__(self):
        self.sem_h = Semaphore(2)
        self.sem_o = Semaphore(1)
        self.bar_assembling = Barrier(3)

    def hydrogen(self, releaseHydrogen: 'Callable[[], None]') -> None:
        with self.sem_h:
            self.bar_assembling.wait()
            releaseHydrogen()
    def oxygen(self, releaseOxygen: 'Callable[[], None]') -> None:
        with self.sem_o:
            self.bar_assembling.wait()
            releaseOxygen()
  #+end_src
#+begin_src python
from concurrent import futures

class Solution:
    def crawl(self, startUrl: str, htmlParser: 'HtmlParser') -> List[str]:
        hostname = lambda url: url.split('/')[2]
        seen = {startUrl}
    
        with futures.ThreadPoolExecutor(max_workers=16) as executor:
            tasks = deque([executor.submit(htmlParser.getUrls, startUrl)])
            while tasks:
                for url in tasks.popleft().result():
                    if url not in seen and hostname(startUrl) == hostname(url):
                        seen.add(url)
                        tasks.append(executor.submit(htmlParser.getUrls, url))
        
        return list(seen)
#+end_src
