content/posts/leetcode-tips.md


### <span class="section-num">26.1</span> dead lock {#dead-lock}

A deadlock is a situation in which processes block each other due to resource acquisition and none of the processes makes any progress as they wait for the resource held by the other process.
To successfully characterize a scenario as deadlock, the following four conditions must hold simultaneously:

-   Mutual Exclusion: At least one resource needs to be held by a process in a non-sharable mode. Any other process requesting that resource needs to wait.
-   Hold and Wait: A process must hold one resource and requests additional resources that are currently held by other processes.
-   No Preemption: A resource can’t be forcefully released from a process. A process can only release a resource voluntarily once it deems to release.
-   Circular Wait: A set of a process {p0, p1, p2,.., pn} exists in a manner that p0 is waiting for a resource held by p1, pn-1 waiting for a resource held by p0.


### <span class="section-num">26.2</span> live lock {#live-lock}

In the case of a livelock, the states of the processes involved in a live lock scenario constantly change. On the other hand, the processes still depend on each other and can never finish their tasks.


### <span class="section-num">26.3</span> Starvation {#starvation}

Starvation is an outcome of a process that is unable to gain regular access to the shared resources it requires to complete a task and thus, unable to make any progress.

One of the possible solutions to prevent starvation is to use a resource scheduling algorithm with a priority queue that also uses the aging technique. Aging is a technique that periodically increases the priority of a waiting process. With this approach, any process waiting for a resource for a longer duration eventually gains a higher priority. And as the resource sharing is driven through the priority of the process, no process starves for a resource indefinitely.

Another solution to prevent starvation is to follow the round-robin pattern while allocating the resources to a process. In this pattern, the resource is fairly allocated to each process providing a chance to use the resource before it is allocated to another process again.


### <span class="section-num">26.4</span> Race condition {#race-condition}

When two processes are competing with each other causing data corruption


### <span class="section-num">26.5</span> Vmware questions {#vmware-questions}

-   What's the diffrence between mutex and spinlock?
    -   mutex will sleep for waiting
    -   spinlock will keep trying (busy waiting)
    -   mutex need do context switch
    -   spinlock doesn't do context switch
    -   using spinlock , we should keep the protected area code very simple and running fast, otherwise ,it may occupy a lot of cpu
-   Can you talk about condition variable
    -   contdition variable always comes with a lock and a condtion checking monitor
    -   condition variable support notify, so once some state chane, we can we can notify condition vaiable, and it will recheck the condition

<!--listend-->

-   <https://leetcode.com/problems/design-bounded-blocking-queue/>
-   <https://leetcode.com/problemset/concurrency/>
-   <https://leetcode.com/problems/print-in-order/discuss/335939/5-Python-threading-solutions>-(Barrier-Lock-Event-Semaphore-Condition)-with-explanation
-   <https://www.baeldung.com/cs/deadlock-livelock-starvation>
-   <https://leetcode.com/problems/fizz-buzz-multithreaded/discuss/542960/python-greater99.28-a-standard-Lock>()-based-solution-with-detailed-explanation
-   <https://stackoverflow.com/questions/5869825/when-should-one-use-a-spinlock-instead-of-mutex>


## <span class="section-num">27</span> System design template {#system-design-template}

```nil
(1) FEATURE EXPECTATIONS [5 min]
	(1) Use cases
	(2) Scenarios that will not be covered
	(3) Who will use
	(4) How many will use
	(5) Usage patterns
(2) ESTIMATIONS [5 min]
	(1) Throughput (QPS for read and write queries)
	(2) Latency expected from the system (for read and write queries)
	(3) Read/Write ratio
	(4) Traffic estimates
		- Write (QPS, Volume of data)
		- Read  (QPS, Volume of data)
	(5) Storage estimates
	(6) Memory estimates
		- If we are using a cache, what is the kind of data we want to store in cache
		- How much RAM and how many machines do we need for us to achieve this ?
		- Amount of data you want to store in disk/ssd
(3) DESIGN GOALS [5 min]
	(1) Latency and Throughput requirements
	(2) Consistency vs Availability  [Weak/strong/eventual => consistency | Failover/replication => availability]
(4) HIGH LEVEL DESIGN [5-10 min]
	(1) APIs for Read/Write scenarios for crucial components
	(2) Database schema
	(3) Basic algorithm
	(4) High level design for Read/Write scenario
(5) DEEP DIVE [15-20 min]
	(1) Scaling the algorithm
	(2) Scaling individual components:
		-> Availability, Consistency and Scale story for each component
		-> Consistency and availability patterns
	(3) Think about the following components, how they would fit in and how it would help
		a) DNS
		b) CDN [Push vs Pull]
		c) Load Balancers [Active-Passive, Active-Active, Layer 4, Layer 7]
		d) Reverse Proxy
		e) Application layer scaling [Microservices, Service Discovery]
		f) DB [RDBMS, NoSQL]
			> RDBMS
			    >> Master-slave, Master-master, Federation, Sharding, Denormalization, SQL Tuning
			> NoSQL
			    >> Key-Value, Wide-Column, Graph, Document
				Fast-lookups:
				-------------
				    >>> RAM  [Bounded size] => Redis, Memcached
				    >>> AP [Unbounded size] => Cassandra, RIAK, Voldemort
				    >>> CP [Unbounded size] => HBase, MongoDB, Couchbase, DynamoDB
		g) Caches
			> Client caching, CDN caching, Webserver caching, Database caching, Application caching, Cache @Query level, Cache @Object level
			> Eviction policies:
				>> Cache aside
				>> Write through
				>> Write behind
				>> Refresh ahead
		h) Asynchronism
			> Message queues
			> Task queues
			> Back pressure
		i) Communication
			> TCP
			> UDP
			> REST
			> RPC
(6) JUSTIFY [5 min]
	(1) Throughput of each layer
	(2) Latency caused between each layer
	(3) Overall latency justification
```


## <span class="section-num">28</span> Leetcode template {#leetcode-template}

```bash
If input array is sorted then
    - Binary search
    - Two pointers

If asked for all permutations/subsets then
    - Backtracking

If given a tree then
    - DFS
    - BFS

If given a graph then
    - DFS
    - BFS

If given a linked list then
    - Two pointers

If recursion is banned then
    - Stack

If must solve in-place then
    - Swap corresponding values
    - Store one or more different values in the same pointer

If asked for maximum/minimum subarray/subset/options then
    - Dynamic programming

If asked for top/least K items then
    - Heap

If asked for common strings then
    - Map
    - Trie

Else
    - Map/Set for O(1) time & O(n) space
    - Sort input for O(nlogn) time and O(1) space
```


## <span class="section-num">29</span> Links {#links}

-   <https://emre.me/categories/#coding-patterns>
-   <https://github.com/seanprashad/leetcode-patterns>
